Core/src/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.СкидкиПоНоменклатурнымГруппам</registerRecords>
  <registerRecords>InformationRegister.СкидкиПоНоменклатурам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяЦена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>EnumRef.СпособыОкругления</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНоменклатур</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяЦена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>EnumRef.СпособыОкругления</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/УстановкаСкидок/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//	УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
	//	Объект,
	//	Параметры.ЗначениеКопирования,
	//	Параметры.Основание,
	//	СостояниеДокумента,
	//	РазрешеноПроведение,
	//	Параметры.ЗначенияЗаполнения
	//);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыНоменклатурПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элементы.ГруппыНоменклатур.ТекущиеДанные.СпособОкругления	= ПредопределенноеЗначение("Перечисление.СпособыОкругления.Вверх");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элементы.Запасы.ТекущиеДанные.СпособОкругления 				= ПредопределенноеЗначение("Перечисление.СпособыОкругления.Вверх");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыФиксированнаяЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные.ФиксированнаяЦена Тогда
		ТекущиеДанные.ПроцентСкидки		= 0;
		ТекущиеДанные.СпособОкругления	= Неопределено;
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыНоменклатурФиксированнаяЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ГруппыНоменклатур.ТекущиеДанные;
	Если ТекущиеДанные.ФиксированнаяЦена Тогда
		ТекущиеДанные.ПроцентСкидки		= 0;
		ТекущиеДанные.СпособОкругления	= Неопределено;
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;
КонецПроцедуры
